---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilteredElementIterator
source: html/ec286c0b-3ed9-d89d-682f-cbddae1e3106.htm
---
# FilteredElementIterator Methods

The current element found by the iterator.